

[
  {
    "id": 0,
    "title": "Cafeteria Frapucho JS",
    "img": "assets/cafes.png",
    "content": "Esta cafetería fue diseñada y creada por mí. Es una idea ficticia para prácticas en el DOM y funcionalidades en el comercio electrónico. Tiene 2 secciones accesibles: La tienda y Sobre Nosotros.",
    "aprendizaje": "Aprendí mucho y mejoré en la estructuración de páginas web en HTML. También aprendí a lograr una armonía visual agradable en CSS y a manejar el DOM en JS. Esto incluye la implementación de funcionalidades como el carrito de compras, secciones de compra, slider de imágenes y el uso de bibliotecas.",
    "loa": "Mi reto fue el carrito; simplemente fue un dolor de cabeza con el que pude salir satisfecho al completarlo. También, la lógica fue algo que me complicó, es un área en la que estoy en constante mejora.",
    "techStack": ["HTML", "CSS", "JavaScript"]
  },
  {
    "id": 1,
    "title": "Orientando Un Futuro",
    "img" : "assets/orientando.png",
    "content":"El proyecto más grande actualmente que tengo consta de aproximadamente 60 páginas. Este proyecto fue diseñado con el objetivo de ayudar a los estudiantes a elegir su carrera profesional, ofreciendo información completa sobre varias opciones. Fuimos tres personas trabajando en este proyecto, y yo asumí el rol de líder y desarrollador principal. Con este proyecto, obtuve mi excelencia y el título de técnico medio en ingeniería informática en sistemas. Actualmente, ya ha sido vendido a cinco colegios y ha beneficiado a más de 150 personas que han encontrado útil esta página.                Link de descarga : https://drive.google.com/drive/folders/1-xZTtmKNBff7PqgQEAbiAFmB7J1qvyA4?usp=sharing",
    "techStack": ["HTML", "CSS", "JavaScript"]
    
  },
  {
    "id": 2,
    "title": "B&B WEB",
    "img" : "assets/B&BLABS.png",
    "content": "La web de un trabajo para la excelencia en mi colegio es de una empresa 'ficticia' con la que obtuve el primer puesto en el colegio, destacando en mi diseño web y los proyectos en los que estuve trabajando como una 'empresa'.",
    "aprendizaje": "Aprendi a exponer delante publico muy grande perdiendo el miedo",
    "loa": " .",
    "techStack": ["HTML", "CSS", "JavaScript"]
  },
  {
    "id": 3,
    "title": "Buscador De Estudiantes React",
    "img" : "assets/students.png",
    "content": "Este proyecto fue una práctica muy buena con filter, map y JSON. Básicamente, es un filtro de un JSON de 5 estudiantes, que filtra nombres, nacionalidad, edad y ID personalizados. Incluye un inicio de sesión cuya contraseña es 'Directores123'.",
    "aprendizaje":"Aprendí a dominar useContext, Custom Hooks, filter y map. Fue una práctica completa que me ayudó demasiado a comprender conceptos más complejos de React.",
    "techStack": ["HTML", "CSS", "react"]
  },
  {
    "id": 4,
    "title": "E-comerce Api/Fetch",
    "img" : "assets/ecomerce.png",
    "content": "Una pequeña tienda en línea que se conecta a una API y realiza una solicitud a los objetos. Tiene una función de filtrado para la búsqueda de precios y la búsqueda por categorías. Su diseño es sencillo, con un slider y su respectiva información.",
    "aprendizaje": "Mi aprendizaje fue entender los estados previos de cada elemento y cómo actualizarlos en tiempo real, es decir, cuando hay un cambio de estado.",
    "loa": "Lo dificil fue intentar el carrito de compras que me queda pendiente aprender en react, se me dificulto un poco este tema",
    "techStack": ["mreact", "CSS", "JavaScript"]
  },
  {
    "id": 5,
    "title": "Generador plateta de colores",
    "img" : "assets/GeneradorDeColores.png",
    "content": "Esto es un generador de paletas de colores que obtiene información de una API con varias configuraciones. En este caso, lo hice de manera simple y busca la paleta de colores en inglés, por ejemplo: 'pink', 'purple', 'gold' y todos los colores en general.",
    "loa": "",
    "techStack": ["HTML", "CSS", "JavaScmanejarript"]
  },
  {
    "id": 6,
    "title": "manejar Un Futvmanejaruro",
    "img" : "assets/B&BLABS.png",
    "content": "Esmanejarta DOMpene ",
    "aprendizaje": "manejar el DOM en JS. E",
    "loa": "   mejora.",
    "techStack": ["HTML", "CSS", "JavaScmanejarript"]
  }
]
